'''
列出字典元素的值

字典的元素是"鍵:值"配對設定，如果想要取得元素的值，可以將鍵當作是索引方式處理，因此字典內的元素不可有重複的鍵

下列可傳回fruits字典水蜜桃鍵的值
fruits['水蜜桃']
'''
# Ch9_03.py 分別列出ch9_1.py, 水果店水蜜桃一斤的價格和麵店牛肉麵一碗的價格。
fruits = {'西瓜': 15, '香蕉':20, '水蜜桃':25}
noodles = {'牛肉麵':100, '肉絲麵':80, '陽春麵':60}
print('水蜜桃一斤 = ', fruits['水蜜桃'], '元')
print('牛肉麵一碗 = ',noodles['牛肉麵'], '元')

# Ch9_04.py 分別列出Ch9_02.py 小兵字典裡的tag和score鍵的值
soldier0 = {'tag':'red', 'score':3}
print('你剛打死標記', soldier0['tag'], '小兵', '\n', '可以得到', soldier0['score'], '分')

'''
有趣的活用'鍵:值', 如果有一字典如下:

fruits = {0:'西瓜', 1:'香蕉', 2:'水蜜桃'}

上述字典鍵是整數時，也可以使用下列方式取得值:
fruit[0] #取得鍵是0的值
'''

# Ch9_4_1.py 有趣列出特定鍵的值
fruits = {0:'西瓜', 1:'香蕉', 2:'水蜜桃'}
print(fruits[0], fruits[1], fruits[2])
