'''
print()函數在格式化過程中，有提供功能可以讓我們設定保留多少格的空間讓資料做輸出，此時格式化的語法如下:

%(+/-)nd: 格式化整數輸出
%(+/-)m.nf: 格式化浮點數輸出
%(+/-)nx: 格式化16進位整數輸出
%(+/-)no: 格式化8進位整數輸出
%(-)ns: 格式化字串輸出
%(-)m.ns: m是輸出字串寬度，n是顯示字串長度，n小於字串長度時會有裁減字串的效果
%(+/-)e: 格式化科學記號e輸出
%(+/-)E: 格式化科學記號E輸出

'''

# ch4_7.py 格式化輸出的應用
x = 100
print("x=/%6d/" % x)
print("x=/%-6d/" % x)
y = 10.5
print("y=/%6.2f/" % y)
s = "deep"
print("s=/%6s/" % s)
print("以下是保留格數空間不足的實例")
print("x")

#  ch4_8.py 格式化輸出，靠左對齊的實例
x = 100
print("x=/%-6d/" % x)
y = 10.5
print("y=/%-6.2f/" % y)
s = "Deep"
print("s=/%-6s/" % s)

# Ch4_9.py 格式化輸出，正值資料將出現正號(+)
x = 10
print("x=/%+6d/" % x)
y = 10.5
print("y=/%+6.2f/" % y)

# Ch4_10.py 格式化輸出的應用。
print("%3s %4s %4s %4s" % ("姓名", "國文", "英文", "總分"))
print("%3s %5d %7d %7d" % ("Mike", 90, 93, 183))
print("%3s %3d %7d %7d" % ("Cheryl", 90, 96, 186))
print("%3s %6d %7d %7d" % ("Tim", 50, 93, 143))
print("%3s %4d %7d %7d" % ("David", 30, 53, 83))

